In [1]:
# imports
import pandas as pd
import matplotlib.pyplot

In [143]:
anonymized_data = pd.read_csv('../data/phase2/anonymized_shuffled_phase2.csv')
public_data = pd.read_excel('../data/phase2/public_data_register_phase2.xlsx')

In [144]:
!pip3 install xlrd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in /home/gregkoncz/.local/lib/python3.8/site-packages (1.2.0)

In [145]:
public_data.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1
1,"el-Asmar, Hasan",Male,1995-02-18,2100,Denmark,Never married,1
2,"Widaa, Cameron",Male,1996-08-24,2300,Denmark,Never married,1
3,"Santos, Jose",Male,2000-05-16,2300,Denmark,Never married,1
4,"Buczynski, Elizabeth",Female,1999-06-03,2300,Denmark,Never married,1

In [146]:
anonymized_data.head()

,sex,evote,age,zip,education,citizenship,party
0,Male,1,30.768506,2400,Vocational Education and Training (VET),Denmark,Green
1,Female,0,47.177024,2400,Vocational Education and Training (VET),Denmark,Green
2,Female,1,46.697183,2400,Vocational bachelors educations,Denmark,Red
3,Female,0,41.181924,2300,Primary education,Denmark,Green
4,Female,0,57.105226,2200,Vocational Education and Training (VET),Not danish,Green

In [147]:
anonymized_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sex          200 non-null    object
 1   evote        200 non-null    int64
 2   age          200 non-null    float64
 3   zip          200 non-null    int64
 4   education    200 non-null    object
 5   citizenship  200 non-null    object
 6   party        200 non-null    object
dtypes: float64(1), int64(2), object(4)
memory usage: 11.1+ KB

In [148]:
public_data['encoded_citizenship'] = public_data['citizenship'].apply(lambda x: 'Denmark' if x == 'Denmark' else 'Not danish')

In [149]:
public_data = public_data[public_data['last_voted'] != 2]
public_data['evote'] = public_data['last_voted']
public_data['detailed_citizenship'] = public_data['citizenship']
public_data['citizenship'] = public_data['encoded_citizenship']

## Merge stuff

In [150]:
merged_df = public_data.merge(anonymized_data, on = ['sex', 'evote', 'citizenship', 'zip'], how = 'outer')

In [151]:
merged_df.shape

(12448, 13)

In [152]:
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green

## second run removing already identified people

In [153]:
public_data.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark
1,"el-Asmar, Hasan",Male,1995-02-18,2100,Denmark,Never married,1,Denmark,1,Denmark
2,"Widaa, Cameron",Male,1996-08-24,2300,Denmark,Never married,1,Denmark,1,Denmark
3,"Santos, Jose",Male,2000-05-16,2300,Denmark,Never married,1,Denmark,1,Denmark
4,"Buczynski, Elizabeth",Female,1999-06-03,2300,Denmark,Never married,1,Denmark,1,Denmark

In [154]:
#public_data = pd.read_excel('../data/phase2/public_data_register_phase2.xlsx')
#print(public_data.shape)
#public_data = public_data[public_data['sex'] == 'Male']
#print(public_data.shape)
#public_data = public_data[public_data['marital_status'] == 'Widowed']
#print(public_data.shape)
#public_data = public_data[public_data['zip'] == 2400]
#print(public_data.shape)
#public_data = public_data[public_data['last_voted'] == 1]
#print(public_data.shape)
#public_data.head(10)

In [155]:
identified_people = set(['Lovan, Adinidiin', 'Fang, Christina', 'Hamilton, Bryce', 'Paudel, Jijo', 'Sayers, Aquasia'])
non_possible_people = set(['Johnson, Auna', 'el-Dajani, Aatifa', 'Fayne, Joanne', 'Bailey, Mika', 'Bannon, Nicole', 'Goldsberry, Madison', 'Muhammad, Keegan', 'Leon Tinoco, Rickilee', 'Gabbin, Azya', 'el-Quedri, Shabaan', 'Acosta, Grant', 'Madel Ramirez, Edwin', 'Mcalister, Wilbert', 'Dessau, Mark', 'Terrazas, Alejandro', 'Braziel-Horne, Peter', 'Gonzales, Regal', 'Bolton, Theador', 'Peterson, Othell', 'Carter, Lauren', 'Sedillo, Rockelle', 'Mcculley, Tiara', 'Cruz, Leslie', 'Dorsett, Kala', 'Cho, Irene', 'Carrillo, Celia', 'Pacht, Carrena', 'al-Rahaman, Muhjar', 'al-Morad, Shafaaa', 'Little, Chandler', 'al-Hamed, Waneesa', 'Bivins, Brittany', 'Najera, Miguelle', 'Hill, Andrew', 'Gheewala, Evan', 'Rahman, Daniel', 'Serha, Ian', 'Zhen, Nickolas', 'Stewart, Daniel', 'Culhane, Jesse', "al-Hamid, Fat'hi", 'Garcia, Luis', 'Im, Ryan', 'Murray, Lance', 'el-Naderi, Shaheed', 'el-Aman, Umair', 'Bean, Elijah', 'Holmes, Saevier', 'Lucky, Brian', 'Self, Michel', 'el-Jama, Ammaar', 'Xiong, Lisiate', 'Nguyen, Johnnie', 'Begay, Russell', 'Velez, Anthony', 'Dever, Mark', 'Martinez, Michel'])
merged_df['people_to_remove'] = merged_df['name'].apply(lambda x: x in identified_people or x in non_possible_people)
merged_df = merged_df[merged_df['people_to_remove'] == False]
merged_df.shape

(11890, 14)

In [157]:
merged_df['calculated_age'] = merged_df['dob'].apply(lambda x: 2020 - x.year)

In [158]:
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,people_to_remove,calculated_age
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green,False,24
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green,False,24
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red,False,24
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green,False,24
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green,False,24

In [123]:
import numpy as np

In [159]:
merged_df['age_diff'] = merged_df['calculated_age'] - merged_df['age']
#merged_df['age_diff'] = merged_df['age_diff'].apply(np.abs)
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,people_to_remove,calculated_age,age_diff
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green,False,24,-13.348805
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green,False,24,-5.298145
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red,False,24,-15.542624
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green,False,24,-4.171254
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green,False,24,2.388973

In [161]:
merged_df = merged_df[merged_df['age_diff'] < 7.5]
merged_df = merged_df[merged_df['age_diff'] > -5.5]
merged_df.shape

(2841, 16)

In [162]:
merged_df[['sex', 'citizenship', 'evote', 'zip', 'name']].groupby(['sex', 'citizenship', 'evote', 'zip']).nunique()
## I think where the count for name is one here, that should be a match

                               name
sex    citizenship evote zip
Female Denmark     0     2100    51
                         2200    57
                         2300    87
                         2400   117
                   1     2100    18
                         2200    38
                         2300    34
                         2400    27
       Not danish  0     2100     2
                         2200     2
                         2300     3
                         2400    10
Male   Denmark     0     2100    36
                         2200    64
                         2300    57
                         2400    92
                   1     2100    24
                         2200    16
                         2300    28
                         2400    41
       Not danish  0     2200     4
                         2400     6
                   1     2400     4

## Searching out and finding rare combinations

In [163]:
female_merged = merged_df[merged_df["sex"] == 'Female']
male_merged = merged_df[merged_df["sex"] == 'Male']

In [164]:
female_evote = female_merged[female_merged['evote'] == 1]
female_evote = female_evote[female_evote['marital_status'] != 'Widowed'] # based on aux
female_paper = female_merged[female_merged['evote'] == 0]
male_evote = male_merged[male_merged['evote'] == 1]
male_evote = male_evote[male_evote['marital_status'] != 'Widowed'] # based on aux
male_paper = male_merged[male_merged['evote'] == 0]

In [165]:
male_evote.shape

(346, 16)

In [166]:
female_evote_danish = female_evote[female_evote['citizenship'] == 'Denmark']
female_evote_nondanish = female_evote[female_evote['citizenship'] != 'Denmark']
female_paper_danish = female_paper[female_paper['citizenship'] == 'Denmark']
female_paper_nondanish = female_paper[female_paper['citizenship'] != 'Denmark']
male_evote_danish = male_evote[male_evote['citizenship'] == 'Denmark']
male_evote_nondanish = male_evote[male_evote['citizenship'] != 'Denmark']
male_paper_danish = male_paper[male_paper['citizenship'] == 'Denmark']
male_paper_nondanish = male_paper[male_paper['citizenship'] != 'Denmark']

In [167]:
female_evote_nondanish

Empty DataFrame
Columns: [name, sex, dob, zip, citizenship, marital_status, last_voted, encoded_citizenship, evote, detailed_citizenship, age, education, party, people_to_remove, calculated_age, age_diff]
Index: []

In [168]:
female_paper_nondanish[female_paper_nondanish['zip'] == 2100] ## cant decide

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,people_to_remove,calculated_age,age_diff
9760,"al-Baddour, Nawwaara",Female,1999-08-07,2100,Not danish,Never married,0,Not danish,0,Sweden,18.137659,Upper secondary education,Green,False,21,2.862341
9761,"Stafford, Mariah",Female,1997-10-20,2100,Not danish,Never married,0,Not danish,0,Romania,18.137659,Upper secondary education,Green,False,23,4.862341

In [169]:
female_evote_nondanish[female_evote_nondanish['zip'] == 2200] ## match

Empty DataFrame
Columns: [name, sex, dob, zip, citizenship, marital_status, last_voted, encoded_citizenship, evote, detailed_citizenship, age, education, party, people_to_remove, calculated_age, age_diff]
Index: []

In [170]:
female_evote_nondanish[female_evote_nondanish['zip'] == 2400] ## match 2

Empty DataFrame
Columns: [name, sex, dob, zip, citizenship, marital_status, last_voted, encoded_citizenship, evote, detailed_citizenship, age, education, party, people_to_remove, calculated_age, age_diff]
Index: []

In [171]:
male_evote_nondanish[male_evote_nondanish['zip'] == 2100] ## match 3

Empty DataFrame
Columns: [name, sex, dob, zip, citizenship, marital_status, last_voted, encoded_citizenship, evote, detailed_citizenship, age, education, party, people_to_remove, calculated_age, age_diff]
Index: []

In [172]:
male_evote_nondanish ## only Paudel matches .

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,people_to_remove,calculated_age,age_diff
2562,"Plummer, Edgar",Male,1966-12-23,2400,Not danish,Divorced,1,Not danish,1,Nepal,53.809517,Vocational Education and Training (VET),Green,False,54,0.190483
2564,"Chang, Kevin",Male,1964-08-03,2400,Not danish,Married/separated,1,Not danish,1,Somalia,53.809517,Vocational Education and Training (VET),Green,False,56,2.190483
2566,"Enriquez, Marcus",Male,1965-08-13,2400,Not danish,Divorced,1,Not danish,1,Netherlands,53.809517,Vocational Education and Training (VET),Green,False,55,1.190483
2568,"De La Rosa, Felipe",Male,1959-09-16,2400,Not danish,Never married,1,Not danish,1,Eritrea,53.809517,Vocational Education and Training (VET),Green,False,61,7.190483

In [173]:
female_evote[['sex', 'citizenship', 'evote', 'zip', 'age', 'name']].groupby(['sex', 'citizenship', 'evote', 'zip', 'age']).nunique()

                                         name
sex    citizenship evote zip  age
Female Denmark     1     2100 23.260386    10
                              24.276624    11
                              26.725296    10
                              47.432241     5
                              48.431793     5
                         2200 24.612206    13
                              28.769921    13
                              30.581843    15
                              30.717271    15
                              31.107778    15
                              37.599490     7
                              38.621897     7
                              44.282284     9
                              53.805837     9
                              75.230199     7
                         2300 20.942843     9
                              22.102592    11
                              23.215098    11
                              28.795302    18
                              34.051761    16
                              39.431709    13
                              40.199983    11
                              41.871451    10
                              48.965601     8
                         2400 37.048394    11
                              38.273006    11
                              43.191165    13
                              46.261110    11
                              46.697183     8
                              47.100830     8
                              51.857893     7
                              53.498671     7
                              64.804004     7

In [138]:
female_evote_danish[female_evote_danish['zip']==2100]

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,people_to_remove,calculated_age,age_diff
2035,"Perry, Leslie",Female,1999-03-01,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,21,2.260386
2037,"Perry, Leslie",Female,1999-03-01,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,21,5.725296
2038,"Perry, Leslie",Female,1999-03-01,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,21,3.276624
2041,"Tomlinson, Leslie",Female,1999-02-18,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,21,2.260386
2043,"Tomlinson, Leslie",Female,1999-02-18,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,21,5.725296
2044,"Tomlinson, Leslie",Female,1999-02-18,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,21,3.276624
2047,"Dunston, Samantha",Female,2000-02-22,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,20,3.260386
2049,"Dunston, Samantha",Female,2000-02-22,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,20,6.725296
2050,"Dunston, Samantha",Female,2000-02-22,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,20,4.276624
2053,"Yoshimura, Elise",Female,1995-07-02,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,25,1.739614
2055,"Yoshimura, Elise",Female,1995-07-02,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,25,1.725296
2056,"Yoshimura, Elise",Female,1995-07-02,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,25,0.723376
2059,"Mcdade, Keleshia",Female,1991-05-08,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,29,5.739614
2061,"Mcdade, Keleshia",Female,1991-05-08,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,29,2.274704
2062,"Mcdade, Keleshia",Female,1991-05-08,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,29,4.723376
2065,"el-Salaam, Hakeema",Female,1993-09-05,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,27,3.739614
2067,"el-Salaam, Hakeema",Female,1993-09-05,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,27,0.274704
2068,"el-Salaam, Hakeema",Female,1993-09-05,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,27,2.723376
2073,"Kiefer, Auriel",Female,1988-02-18,2100,Denmark,Divorced,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,32,5.274704
2074,"Kiefer, Auriel",Female,1988-02-18,2100,Denmark,Divorced,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,32,7.723376
2077,"Truong, Crystal",Female,1990-05-06,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,30,6.739614
2079,"Truong, Crystal",Female,1990-05-06,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,30,3.274704
2080,"Truong, Crystal",Female,1990-05-06,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,30,5.723376
2085,"Vinnola, Leslie",Female,1986-11-28,2100,Denmark,Divorced,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,34,7.274704
2089,"el-Basha, Muna",Female,1993-07-07,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,27,3.739614
2091,"el-Basha, Muna",Female,1993-07-07,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,27,0.274704
2092,"el-Basha, Muna",Female,1993-07-07,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,27,2.723376
2095,"Munoz, Valeria",Female,1989-08-11,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,31,7.739614
2097,"Munoz, Valeria",Female,1989-08-11,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,31,4.274704
2098,"Munoz, Valeria",Female,1989-08-11,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,31,6.723376
2101,"Ho, Tina",Female,1992-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,28,4.739614
2103,"Ho, Tina",Female,1992-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,28,1.274704
2104,"Ho, Tina",Female,1992-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,28,3.723376
2107,"Chapman, Carlee",Female,1991-01-02,2100,Denmark,Never married,1,Denmark,1,Denmark,23.260386,Not stated,Green,False,29,5.739614
2109,"Chapman, Carlee",Female,1991-01-02,2100,Denmark,Never married,1,Denmark,1,Denmark,26.725296,Not stated,Green,False,29,2.274704
2110,"Chapman, Carlee",Female,1991-01-02,2100,Denmark,Never married,1,Denmark,1,Denmark,24.276624,Vocational Education and Training (VET),Green,False,29,4.723376
2126,"Lawrence, Morgan",Female,1977-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,False,43,5.431793
2129,"Lawrence, Morgan",Female,1977-03-26,2100,Denmark,Never married,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,False,43,4.432241
2132,"Warwick, Tianna",Female,1976-01-14,2100,Denmark,Married/separated,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,False,44,4.431793
2135,"Warwick, Tianna",Female,1976-01-14,2100,Denmark,Married/separated,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,False,44,3.432241
2150,"Strom, Hannah",Female,1979-11-18,2100,Denmark,Married/separated,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,False,41,7.431793
2153,"Strom, Hannah",Female,1979-11-18,2100,Denmark,Married/separated,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,False,41,6.432241
2156,"el-Assad, Nameera",Female,1979-08-21,2100,Denmark,Married/separated,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,False,41,7.431793
2159,"el-Assad, Nameera",Female,1979-08-21,2100,Denmark,Married/separated,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,False,41,6.432241
2162,"Cartwright, Paige",Female,1972-05-04,2100,Denmark,Married/separated,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,False,48,0.431793
2165,"Cartwright, Paige",Female,1972-05-04,2100,Denmark,Married/separated,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,False,48,0.567759
2168,"Hayes-Joshua, Jemeeka",Female,1970-08-23,2100,Denmark,Divorced,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,False,50,1.568207
2171,"Hayes-Joshua, Jemeeka",Female,1970-08-23,2100,Denmark,Divorced,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,False,50,2.567759
2174,"Peterson, Morgan",Female,1970-11-26,2100,Denmark,Never married,1,Denmark,1,Denmark,48.431793,Vocational Education and Training (VET),Green,False,50,1.568207
2177,"Peterson, Morgan",Female,1970-11-26,2100,Denmark,Never married,1,Denmark,1,Denmark,47.432241,Vocational Education and Training (VET),Green,False,50,2.567759

In [174]:
male_evote[['sex', 'citizenship', 'evote', 'zip', 'age', 'name']].groupby(['sex', 'citizenship', 'evote', 'zip', 'age']).nunique()

                                       name
sex  citizenship evote zip  age
Male Denmark     1     2100 26.083445    15
                            26.106013    15
                            28.802569    15
                            29.269073    15
                            30.357140    16
                            32.361569    14
                            37.814819     6
                            41.984883     5
                            54.001253     3
                            59.893174     2
                       2200 21.611027     9
                            28.171254    10
                            29.298145    11
                            37.348805     6
                            38.450169     5
                            39.542624     4
                       2300 20.080954     6
                            38.353330     4
                            46.486765    13
                            50.062405    14
                            52.462269    14
                            52.762678    14
                            58.129052     7
                            58.966695     7
                       2400 30.768506     9
                            44.039302    14
                            44.846198    16
                            51.677135    14
                            52.120187    14
                            53.690564    16
                            55.162699    16
                            65.956483     8
                            68.771132     5
     Not danish  1     2400 53.809517     4

In [202]:
female_paper_danish[female_paper_danish['zip'] == 2400]

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,people_to_remove,calculated_age,age_diff
9778,"el-Azizi, Sumaita",Female,1992-06-22,2400,Denmark,Never married,0,Denmark,0,Denmark,22.204190,Primary education,Green,False,28,5.795810
9799,"Wesley, Naaamorkor",Female,2000-05-20,2400,Denmark,Never married,0,Denmark,0,Denmark,22.204190,Primary education,Green,False,20,-2.204190
9810,"Wilson, Cheyenne",Female,1979-10-30,2400,Denmark,Married/separated,0,Denmark,0,Denmark,37.958748,Vocational bachelors educations,Green,False,41,3.041252
9813,"Wilson, Cheyenne",Female,1979-10-30,2400,Denmark,Married/separated,0,Denmark,0,Denmark,42.720080,Masters programmes,Red,False,41,-1.720080
9817,"Wilson, Cheyenne",Female,1979-10-30,2400,Denmark,Married/separated,0,Denmark,0,Denmark,39.939204,Masters programmes,Red,False,41,1.060796
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12334,"al-Amara, Sajaa",Female,1956-10-28,2400,Denmark,Married/separated,0,Denmark,0,Denmark,58.868363,Upper secondary education,Green,False,64,5.131637
12335,"al-Amara, Sajaa",Female,1956-10-28,2400,Denmark,Married/separated,0,Denmark,0,Denmark,65.920059,Vocational Education and Training (VET),Red,False,64,-1.920059
12336,"al-Amara, Sajaa",Female,1956-10-28,2400,Denmark,Married/separated,0,Denmark,0,Denmark,67.390715,Vocational bachelors educations,Red,False,64,-3.390715
12338,"al-Amara, Sajaa",Female,1956-10-28,2400,Denmark,Married/separated,0,Denmark,0,Denmark,64.234821,Vocational bachelors educations,Red,False,64,-0.234821
12342,"al-Amara, Sajaa",Female,1956-10-28,2400,Denmark,Married/separated,0,Denmark,0,Denmark,65.760504,Vocational Education and Training (VET),Green,False,64,-1.760504

In [141]:
public_data[['name', 'sex', 'zip', 'marital_status', 'evote']].groupby(['sex', 'zip', 'marital_status', 'evote']).count()

                                     name
sex    zip  marital_status    evote
Female 2100 Divorced          0         5
                              1         5
            Married/separated 0        18
                              1         8
            Never married     0        33
                              1        19
            Widowed           0         1
       2200 Divorced          0         8
                              1         7
            Married/separated 0        42
                              1        20
            Never married     0        29
                              1        16
            Widowed           0         4
                              1         1
       2300 Divorced          0        13
                              1         3
            Married/separated 0        39
                              1        22
            Never married     0        38
                              1        22
            Widowed           0         8
                              1         1
       2400 Divorced          0        15
                              1         5
            Married/separated 0        89
                              1        22
            Never married     0        26
                              1        15
            Widowed           0        10
Male   2100 Divorced          0         2
            Married/separated 0        16
                              1         9
            Never married     0        26
                              1        18
            Widowed           0         1
       2200 Divorced          0         6
                              1         4
            Married/separated 0        36
                              1        15
            Never married     0        36
                              1        20
            Widowed           0         5
       2300 Divorced          0         5
                              1         4
            Married/separated 0        36
                              1        14
            Never married     0        25
                              1        19
            Widowed           0         2
                              1         2
       2400 Divorced          0        18
                              1         8
            Married/separated 0        52
                              1        22
            Never married     0        30
                              1        20
            Widowed           0         9
                              1         3

In [142]:
female_paper_nondanish[female_paper_nondanish['zip'] == 2300]

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,people_to_remove,calculated_age,age_diff
12386,"Hoang, Susana",Female,1984-11-19,2300,Not danish,Never married,0,Not danish,0,Lithuania,31.604629,Vocational bachelors educations,Red,False,36,4.395371
12387,"Riker, Taelor",Female,1983-04-22,2300,Not danish,Married/separated,0,Not danish,0,Bulgaria,31.604629,Vocational bachelors educations,Red,False,37,5.395371
12389,"Carranco, Randelle",Female,1988-12-05,2300,Not danish,Never married,0,Not danish,0,Lithuania,31.604629,Vocational bachelors educations,Red,False,32,0.395371